/*        
        
        x=w/l -> w-l*x =0
        f(x) = w-l*x;
        将边权更改为w-l*x来求生成树

       因为f(x)是个单调递减函数,随着x的增大而减少
       对于任意一个生成树如果
        f(x)>0        则   l需要增大
        f(x)<0        否则 l需要减小

       若要满足f(x)==0恒成立
       1.若要x取最大值，则不能存在任意一个生成树f(x)>0,否则x还能继续增大,即任意生成树f(x)<=0
         若存在一个生成树f(x)>0，则那个生成树的比率一定大于当前x,w/l > x -> w-l*x > 0
       2.若要x取最小值，则不能存在任意一个生成树f(x)<0,否则x还能继续减小,即任意生成树f(x)>=0
         若存在一个生成树f(x)<0，则那个生成树的比率一定小于当前x,w/l < x -> w-l*x < 0

       若要满足f(x)>0恒成立，则最小生成树>0
       若要满足f(x)<0恒成立，则最大生成树<0

        此题目求解最小的x值，也就是检查是否所有的生成树f(x)>=0，即最小生成树>=0

        如果最小生成树大于0,所有的生成树都满足f(x)>0,尝试增加x得到f(x)=0
        否则，有生成树不满足这个条件，那么x一定要减少来使所有f(x)>=0

*/